modules/User/Controllers/UserController.php

select * from `core_subscribers` where `email` = 'pov.em@g.asia' limit 1
---
    public function subscribe(Request $request)
    {
        $this->validate($request, [
            'email' => 'required|email|max:255'
        ]);
        $check = Subscriber::withTrashed()->where('email', $request->input('email'))->first();